{
  "master": {

  },
  "2-frontend": {
    "children": {
      "root": {
        "children": {

        }
      },
      "2.3-members": {
        "description": "Interface for listing and creating users, as well as assigning roles and event slots.",
        "children": {
          "root": {
            "children": {
              "create new member form": {
                "description": "The new member form has fields for name, email, and avilable roles. It has to validate input and respond with error or success based on the server response when trying to create a new user.",
                "date": 20180114,
                "children": {
                  "_newform.send": {
                    "description": "Submitting the form can only be done when all the fields have been validated. Once validated, the results have to be sent to the server in the correct order. The first and last names and the email are sent to the server to create the user. Once the user is successfully created, an activation email must be sent. Once the email has been sent successfully, the roles can be added to the user, else it is deleted.",
                    "children": {
                      "check user": "Check if the user exists by fetching records",
                      "create user": "Send a request with names and email. Username is created temporarily.",
                      "send activation email": {
                        "description": "Hit a snag where apparently this isn't a function.",
                        "children": {
                          "Member was not accessible by queryset due to 'staff' status": "SOLVED",
                        }
                      },
                      "activation email template": "Simple template to display the key for copying.",
                      "email connection refused": "Return true from email activation method for now.",
                      "adding roles": {
                        "description": "Picking up from the previous day, role creation not working for some reason. This is likely because it is failing at the serialiser and returning error that I ignore.",
                        "children": {
                          "added default='' to the nickname field in Role": "SOLVED"
                        }
                      },
                      "all working. Before doing interface effects, there appears to be a problem with the list.": {
                        "description": "",
                        "children": {
                          "likely to do with test prefiltering.": "It was. Added member id filter to filter.condition. SOLVED"
                        }
                      },
                      "error and exception handling": {
                        "description": "",
                        "children": {
                          "names are blank": "",
                          "email is blank": "",
                          "email no regex match": "",
                          "no role selected": "",
                          "member already exists": "maybe email input should be a global member search",
                          "sending activation email": "",
                          "activation email failed": "not a real email"
                        }
                      },
                      "interface updates": {
                        "children": {
                          "update member list": "",
                          "hide new panel": "",
                          "show single panel of new member": ""
                        }
                      }
                    }
                  },
                  "try email only with search": {
                    "Change title to 'invite'": "DONE"
                  },
                  "moving member interfaces to multiple files to simplify definitions": {
                    "children": {
                      "create main.js, new.js, single.js and add to html template.": "DONE",
                    }
                  }
                }
              },
            }
          },
          "2.3.1-members-multi-interface": {
            "description": "Moving constituent member interfaces to different files to better separate the functions.",
            "children": {
              "root": {
                "Create new files for each interface and add paths to app.html": "DONE",
                "Move single logic": "DONE",
                "Move new logic": "DONE",
              }
            }
          },
          "2.3.2-members-invite-member": {
            "description": "Instead of putting the burden of naming the member onto the admin, instead rely on the new member to name themselves. Also account for the possibility that the member already exists on the system, but does not have roles with this club.",
            "children": {
              "20180115": {
                "children": {
                  "add member list unrestricted by club id. Allow site wide search of members."
                  "add interaction with email input. Only show list when focussed, or when the input is empty"
                }
              }
            }
          }
        }
      },
      "2.4-account-focus": {
        "description": "Start from the point of view of the account-holder, and move through functionality in a natural way.",
        "date": 20180115,
        "children": {
          "Look at proxies": "https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Proxy",
          "Idea of a unified interface": {
            "description": "A single interface should have a single purpose and move around the screen as a unit. When dismissing an interface, no part of it should still be needed. When recalled, it resets to a natural resting state.",
            "date": 20180115,
          },
          "Load": {
            "description": "Open the app with a loading indicator to give the interface time to load all relevant objects into memory.",
            "children": {
              "just a bit of text": "DONE",
              "something during loading process is causing style to change": "Make sure all elements stay inside boundary, including margins, such as from float.",
              "modified setStyle to only animate changes made to the style, with a snazzy new _.change method.": {
                "description": "DONE",
                "date": 20180116,
              }
            }
          },
          "Make empty object for Components.list": {
            "description": "A list should display something when empty, and also when loading. This function can be overridden, by modifying _list.empty",
            "date": 20180116,
            "children": {
              "Add _list.empty function"
              "If there is nothing to display at the end of the load method, this should be displayed."
            }
          },
          "Gradual interface design": {
            "description": "I have a vision for the way the interface should look, but I don't want to spend time making it look perfect yet, so instead, I will build it gradually. Where I would have a properly coded loading indicator, I will simply have a piece of text that fades when the data has loaded. Later, this loading process can be more closely linked to whatever loading display I decide to build. Right now, the interface works and is intuitive, and notably, nothing is in the way of any further development. Later, bit by bit, I can develop the pieces I think would make the interface better.",
            "date": 20180116
          },
          "Remove style, class, and property definitions from states.": {
            "description": "The functions are much more versatile, and should honestly just be combined into one.",
            "date": 20180116,
            "children": {
              "style combination": "the problem with doing this, is it means abandoning the ability to combine styles from different levels of states, although a sync will now only include the style elements that have changed, yielding roughly the same effect.",
              "Ok burn it.": "DONE",
            }
          },
          "Clubs": {
            "description": "Start from list of clubs that the member logged in is a part of.",
            "date": 20180116,
            "children": {
              "crest": "Club list item should start with the club crest",
              "club name": "Club list item should contain the full name of the club",
              "upcoming events": "Club list item should display a list of upcoming events that the member is a part of.",
              "invitations": "Club list item should display a list of invitations to roles that the member has been offered.",
              "single": {
                "description": "Displays a single club. Most obvious thing should be a heads-up display of upcoming events for the active user.",
                "date": 20180117,
                "children": {
                  "add single club function": "DONE",
                }
              }
            }
          },
          "Adding sidebar": {
            "description": "Sidebar menu, including college crest.",
            "date": 20180117,
            "children": {

            }
          },
          "Account": {
            "description": "At the top of the page, the user should be able to access their user details, including password changing functions.",
            "children": {

            }
          },
          "Members": {
            "description": "A list of users on the system, filtered by active club.",
            "children": {
              ""
            },
          },
          "Events": {
            "description": "A list of upcoming and past events, filtered by active club."
          },
          "Assets": {
            "description": "A list of assets, filtered by active club."
          }
        }
      }
    }
  }
}
